import { Helmet } from "react-helmet";
import BannersCarousel from "../components/BannersCarousel";
import Container from "../components/Container";
import { motion } from "framer-motion";
import { pageMotion } from "../page-motion";

const metadata = {
  "title": "Народна зірка смерті",
  "description": "Сергій Притула пояснив, у чому перевага супутника ICEYE та які дані отримуватиме Україна.",
  "imageUrl": "https://novy.tv/wp-content/uploads/sites/96/2022/08/18.08_prytula_suputnyk-2.jpg",
  "webPageUrl": "folk-star-of-death.ua"
}

const Home = () => {
  return (
    <motion.div 
      variants={ pageMotion }
      initial="hidden"
      animate="visible"
      exit="exit"
    >
      <Helmet>
        <title>{ metadata.title }</title>
        <meta name="description" content={ metadata.description } />
        <meta property="og:title" content={ metadata.title } />
        <meta property="og:description" content={ metadata.description } />
        <meta property="og:type" content="website" />
        <meta property="og:url" content={ metadata.webPageUrl } />
        <meta property="og:image" content={ metadata.imageUrl } />
        <meta name="twitter:card" content="summary"/>
        <meta name="twitter:title" content={ metadata.title }/>
        <meta name="twitter:description" content={ metadata.description } />
        <meta name="twitter:site" content={ metadata.webPageUrl } />
        <meta name="twitter:image" content={ metadata.imageUrl } />
      </Helmet>
      <main>
        <BannersCarousel />
        <section name="section1">
          <Container>
            <h1>Про супутник</h1>
            <p>На відміну від оптичного супутника, який може працювати тільки вдень та у чистому небі, SAR супутник діє як ліхтар — він “підсвічує” поверхню землі власними радіохвилями. Тому для зйомки неважливі перешкоди, ніч, хмари, дощ, туман, задимленість. SAR супутник “пробиває” все своїми радіохвилями.</p>
            <p><strong>Періодичність прольотів</strong></p>
            <p>Супутник пролітає над нашою територією двічі на добу. Супутникові знімки території нашої країни отримує лише українська сторона як власник супутника, тому доступ є ексклюзивним. Коли супутник не летить над територією України, ми можемо отримувати дані завдяки доступу до сузір’я SAR супутників компанії ICEYE.Таким чином забезпечується безперервне отримання даних.</p>
            <p><strong>Роздільна здатність</strong></p>
            <p>Від 0,5 метра до 1 метра залежно від площі охоплення знімка. Один знімок може охоплювати площу до 225 квадратних кілометрів.</p>
            <p><strong>Швидкість отримання даних</strong></p>
            <p>Іноземні партнери дійсно забезпечують Україну супутниковими знімками, але із затримкою.</p>
            <p>Завдяки тому, що Україна викупила супутник, процес передачі даних від моменту знімка до моменту отримання його безпосередньо військовими підрозділами скорочується до кількох годин. За умов війни швидкість отримання інформації – це суттєва перевага.</p>
            <p>У червні українці за три дні зібрали 600 млн грн на купівлю трьох турецьких безпілотників Bayraktar-ТВ2. Збір коштів на кампанію "Народний байрактар" організував Фонд Сергія Притули.</p>
            <p>Турецька компанія Baykar вирішила надати українцям ці безпілотники безкоштовно, тому народним грошам довелося шукати інше застосування. Фонд Притули вступив у перемовини з Міністерством оборони, щоб максимально корисно витратити зібрані кошти.</p>
            <p>У соцмережах намагалися вгадати, що за них придбають. Найближчим до істини виявився варіант космічної станції "Зірка смерті". Гроші витратили на купівлю та оренду високотехнологічних розвідувальних супутників.</p>
            <p>Фонд Сергія Притули уклав контракт із фінською космічною компанією ICEYE. Україна отримає на понад рік безлімітний доступ до фотографій її 21 супутника та безстроково отримає повне управління одним із них.</p>
            <p>Послугу з передавання супутника компанія ICEYE описує як можливість самостійно організувати управління апаратом, спланувати місію та визначити ціль для збору інформації.</p>
            <p>Супутники ICEYE використовують технологію Synthetic aperture radar (SAR). Такі космічні апарати замість традиційної оптичної зйомки запускають на Землю радіолокаційні хвилі, а потім приймають сигнал, який відбивається від об’єктів.</p>
            <p>Головне управління розвідки (ГУР) матиме доступ до фотографій з усіх супутників компанії. Їх орбіти перетинаються, що збільшує кількість знімків. У фонді розповіли, що вся мережа супутників зможе робити близько 36 світлин на добу.</p>
            <p>У релізі щодо укладення угоди з Україною компанія опублікувала своє фото Керченського мосту – давньої цілі для ЗСУ.</p>
          </Container>
        </section>
      </main>
    </motion.div>
  )
}

export default Home;